app/controllers/paintings_controller.rb

  def index
    @paintings = Painting.all
---
SELECT "paintings".* FROM "paintings"

  def create
    @painting = Painting.new(painting_params)

    respond_to do |format|
      if @painting.save
---
INSERT INTO "paintings" ("created_at", "image", "name", "remote_image_url", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 23 Jan 2014 15:14:54 UTC +00:00], ["image", ""], ["name", ""], ["remote_image_url", ""], ["updated_at", Thu, 23 Jan 2014 15:14:54 UTC +00:00]]

  def update
    respond_to do |format|
      if @painting.update(painting_params)
---
UPDATE "paintings" SET "image" = ?, "updated_at" = ? WHERE "paintings"."id" = 8  [["image", "DSCN8447.JPG"], ["updated_at", Thu, 23 Jan 2014 17:32:35 UTC +00:00]]

  def destroy
    @painting.destroy
---
DELETE FROM "paintings" WHERE "paintings"."id" = ?  [["id", 1]]

    def set_painting
      @painting = Painting.find(params[:id])
---
SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", "8"]]